#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
random_password.osem_db_master_pass: Refreshing state... [id=none]
aws_route53_record.route_53_dmarc_txt: Refreshing state... [id=Z0173878287JIU5M4KB8R__dmarc.seagl.org_TXT]
aws_secretsmanager_secret.osem-db-pass: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:663166083306:secret:db-pass-osem-5KW1mS]
aws_ses_domain_identity.email_domain_identity: Refreshing state... [id=seagl.org]
aws_ses_email_identity.email: Refreshing state... [id=sre@seagl.org]
data.aws_vpc.vpc: Reading...
aws_db_subnet_group.osem: Refreshing state... [id=osem]
aws_ses_domain_identity.seagl: Refreshing state... [id=seagl.org]
aws_route53_record.route_53_root_txt: Refreshing state... [id=Z0173878287JIU5M4KB8R__TXT]
aws_instance.dokku: Refreshing state... [id=i-02ee81d4bd0860d30]
aws_s3_bucket.state: Refreshing state... [id=seagl-terraform]
aws_route53_record.seagl_amazonses_verification_record: Refreshing state... [id=Z0173878287JIU5M4KB8R__amazonses.seagl.org_TXT]
aws_ses_domain_dkim.email_dkim: Refreshing state... [id=seagl.org]
aws_secretsmanager_secret_version.osem-db-pass-val: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:663166083306:secret:db-pass-osem-5KW1mS|5E8ED816-E9AA-4E8E-A382-2EEE9FC74A66]
aws_route53_record.email_dkim_records[2]: Refreshing state... [id=Z0173878287JIU5M4KB8R_o7o3tsrrlwgkmmx3a7f5njkrvi75woso._domainkey.seagl.org_CNAME]
aws_route53_record.email_dkim_records[1]: Refreshing state... [id=Z0173878287JIU5M4KB8R_zjerfwsrr5wpwp5p5klnsrrzp6ralpcp._domainkey.seagl.org_CNAME]
aws_route53_record.email_dkim_records[0]: Refreshing state... [id=Z0173878287JIU5M4KB8R_nldzqxeyq5fyslu3tzvj4ltbwbexupuj._domainkey.seagl.org_CNAME]
data.aws_vpc.vpc: Read complete after 0s [id=vpc-231ecb46]
aws_security_group.osem_rds_security_group: Refreshing state... [id=sg-006c493d98f3c7f1a]
aws_db_instance.osem: Refreshing state... [id=osem]
aws_security_group_rule.private_out: Refreshing state... [id=sgrule-1612436969]
aws_security_group_rule.private_in: Refreshing state... [id=sgrule-3182957500]
aws_s3_bucket_public_access_block.state: Refreshing state... [id=seagl-terraform]
aws_s3_bucket_versioning.state: Refreshing state... [id=seagl-terraform]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_record.alias will be created
  + resource "aws_route53_record" "alias" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "alias.seagl.org"
      + records         = [
          + "35.88.10.210",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # aws_s3_bucket_acl.state will be created
  + resource "aws_s3_bucket_acl" "state" {
      + acl    = "private"
      + bucket = "seagl-terraform"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @sntxrr, Action: `pull_request`*